{
  "backend/main.mo": "Defines booking and user profile types with access-controlled queries and updates, including booking submission, lookup, and admin-only management.",
  "feature_evidence.json": "Feature evidence report referencing the Google verification meta tag added to frontend/index.html.",
  "frontend-file-summaries.txt": "JSON-like list of short summaries for all frontend source files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens, animations, and base utility layers.",
  "frontend/index.html": "Main HTML entry file including charset, viewport, Google verification meta tag, and root script mount.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for home, admin, and status pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen showing an access denied message with a button redirecting users to the homepage.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with header, navigation (desktop and mobile), login button, footer, and gradient background.",
  "frontend/src/components/BookingFormCard.tsx": "Booking form component with validation, submission handling, and success state showing booking ID.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity and manages authentication state and loading UI.",
  "frontend/src/components/OwnerSection.tsx": "Displays owner information with an editable profile image and contact buttons.",
  "frontend/src/components/VehiclesSection.tsx": "Renders a grid of vehicle cards, overriding images for pickup trucks and showing driver info.",
  "frontend/src/constants/vehicles.ts": "Defines the Vehicle interface and exports a list of vehicle entries with drivers and images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, updating queries when identity changes.",
  "frontend/src/hooks/useAdminBookings.ts": "Provides admin-focused hooks to check admin status and manage bookings, including fetching, updating, and deleting.",
  "frontend/src/hooks/useBookings.ts": "Exposes a hook to submit new bookings and invalidate related queries on success.",
  "frontend/src/hooks/useBookingStatusLookup.ts": "Fetches bookings by phone or numeric query, attempting ID lookup before falling back to phone search.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth state, providing login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and updates the caller’s user profile through the backend actor.",
  "frontend/src/index.css": "Re-exports global CSS from the parent index.css.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin dashboard for managing bookings, user profile setup, and status updates with UI components.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, booking form, feature cards, and vehicle section components using animated UI elements.",
  "frontend/src/pages/StatusPage.tsx": "Provides a booking status lookup page with a search form and displays matching bookings using icons, badges, and formatted timestamps.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL or session-based parameters, including hash‑route support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugin usage.",
  "project_state.json": "Project state metadata describing implemented features, architecture notes, and versioned requirements for the transport booking app."
}